docs/commonlisp-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-24 Sun 21:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Common Lisp notes and thinkings (Part I: Functions)</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">Common Lisp notes and thinkings (Part I: Functions)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org405b88d">1. (eq function object) ?</a>
<ul>
<li><a href="#org65fbfa4">1.1. Three state of a function</a></li>
<li><a href="#orga1f4e0c">1.2. Closure: those functions who have <b>undefined</b> variable</a></li>
</ul>
</li>
<li><a href="#org01dec8d">2. Functional programming principle</a></li>
<li><a href="#org4d43fe1">3. From Bottom to Top: another programming Strategy</a>
<ul>
<li><a href="#orged19a34">3.1. Some abstraction examples of functions</a></li>
<li><a href="#orgb472bb4">3.2. Rethink Recursion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org405b88d" class="outline-2">
<h2 id="org405b88d"><span class="section-number-2">1.</span> (eq function object) ?</h2>
<div class="outline-text-2" id="text-1">
<p>
Yes.
</p>
</div>
<div id="outline-container-org65fbfa4" class="outline-3">
<h3 id="org65fbfa4"><span class="section-number-3">1.1.</span> Three state of a function</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We use <code>(defun plus1 (x) (\+ x 1))</code> to define a function named <code>'plus1</code>,
 and we can use <code>(plus1 2)</code> to get a result of <code>3</code>.
 This is the most of operation in LISP, where we can summerize
</p>

<p>
three types of state for this function, as:
</p>
<ul class="org-ul">
<li><b>plus1</b>: which is the funcall;</li>
<li><b>'plus1</b>: which is the name of this function;</li>
<li><b>#'plus1</b>: which is the data of this function, i.e. (x) (\+ 1)</li>
</ul>
</div>
</div>
<div id="outline-container-orga1f4e0c" class="outline-3">
<h3 id="orga1f4e0c"><span class="section-number-3">1.2.</span> Closure: those functions who have <b>undefined</b> variable</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-elisp">(setq w
(let ((a 3))
  (defun plus-a (x) (+ x a))
         (plus-a 5)
))
</pre>
</div>

<p>
In this example, we have <code>a</code> as the <b>free variable</b> (which is
<i>undefined</i> in function <code>plus-a</code> while we use <code>a</code> in the
function body). Thus, we can use <code>plus-a</code> to produce different
functions with different <code>a</code>. Here <code>plus-a</code> is a closure.
</p>
</div>
</div>
</div>
<div id="outline-container-org01dec8d" class="outline-2">
<h2 id="org01dec8d"><span class="section-number-2">2.</span> Functional programming principle</h2>
<div class="outline-text-2" id="text-2">
<p>
What is FPP?
</p>

<p>
FPP denotes: use the <b>return value</b>, instead of <b>setted value</b>.
</p>

<p>
For example, we want <code>(+1 a)</code> return the result "a+1" instead of
change the value of <code>a</code> to "a+1".
</p>

<p>
FFP tell you "I want to do such things", while the instruction principle
tell you "I have do such things".
</p>

<p>
Example:
</p>


<div class="org-src-container">
<pre class="src src-elisp">(defun f (x)
  (list 'a (expt (car x) 2)))

(defun f2 (x)
  (let (y sqr)
    (setq y (car x))
    (setq sqr (expt y 2))
    (list 'a sqr)))
</pre>
</div>

<p>
That's the main obstacle of learning LISP, if you have already know
C++, JAVA, PYTHON, and so on.
</p>
</div>
</div>
<div id="outline-container-org4d43fe1" class="outline-2">
<h2 id="org4d43fe1"><span class="section-number-2">3.</span> From Bottom to Top: another programming Strategy</h2>
<div class="outline-text-2" id="text-3">
<p>
What we learn in courses or real-world encourage us to give a plan
first, and then plan to divide a complex project into several simple
parts, and finally solve these parts to obtain a final results.
</p>

<p>
That's a great idea. However, sometimes it is vital to begin with another
direction, which argues that:
</p>
<ol class="org-ol">
<li>planning is difficult and complex, people are lazy;</li>
<li>we have no understanding of what we need to do, so the planning
might be wroning most of the time;</li>
<li>the enthusim of one thing always takes 3 minutes, indicating the
reward of what we do is quite important;</li>
</ol>


<p>
Therefore, I recommand another programming strategy, FBTT, after you
have a thoroughly plan of what you need to do.
</p>

<p>
The functional-style programming is suitable to these kind of programming
strategy, because we can test every function, and develope new language
on our own fields.
</p>
</div>
<div id="outline-container-orged19a34" class="outline-3">
<h3 id="orged19a34"><span class="section-number-3">3.1.</span> Some abstraction examples of functions</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(proclaim '(inline last1 single append1 nconc1 mklist)) ;; compile it

;; git last element
(defun last1 (ls) (car (last ls)))
;; if single or not
(defun single (ls) (and (consp ls) (not (cdr ls))))
;; append an element
(defun append1 (ls obj) (append ls (list obj)))
;; append an element and change the input parameter
(defun nconc1 (ls obj) (nconc ls (list obj)))
;; construct a list.
(defun mklist (obj) (if (listp obj) obj (list obj)))

;; whether len(x)&gt;len(y) or not.
(defun longer (x y)
  (labels ((compare (x y)
                    (and (consp x) (or (null y) (compare (cdr x) (cdr y))))))
    (if (and (listp x) (listp_y))
        (compare x y)
      (&gt; (length x) (length y)))))

;; record the result if true, else do not record.
(defun filter (fn ls)
  (let ((acc nil))
    (dolist (x ls)
      (let ((val (funcall fn x)))
        (if val (push val acc)))
      (nreverse acc))))

;; group source list into n numbers sub-lists.
(defun group (source n)
  (if (zerop n) (error "zero length"))
  (labels ((rec (source acc)
                (let ((rest (nthcdr n source)))
                  (if (consp rest)
                      (rec rest (cons (subseq source 0 n) acc)))
                  (nreverse (cons source acc)))))
    (if source (rec source nil) nil)))

(defun flatten (x)
  (labels ((rec (x acc)
                (cond ((null x) acc)
                      ((atom x) (cons x acc))
                      (t (rec (car x) (rec (cdr x) acc))))))
    (rec x nil)))

(defun prune (test tree)
  (labels ((rec (tree acc)
                (cond ((null tree) (nreverse acc))
                      ((consp (car tree))
                       (rec (cdr tree)
                            (cons (rec (car tree) nil) acc)))
                      (t (rec (cdr tree)
                              (if (funcall test (car tree))
                                  acc
                                (cons (car tree) acc)))))))
    (rec tree nil)))


(defun find2 (fn ls)
  (if (null ls)
      nil
    (let ((val (funcall fn (car ls))))
      (if val(values (car ls) val)
        (find2 fn (cdr ls))))))

(defun before (x y ls &amp;key (test #'eql))
  (and ls
       (let ((first (car ls)))
         (cond ((funcall test y first) nil)
               ((funcall test x first) nil)
               (t (before x y (cdr ls) :test test))))))

(defun after (x y ls &amp;key (test #' eql))
  (let ((rest (before y x ls :test test)))
    (and rest (member x rest :test test))))

(defun duplicate (obj ls &amp;key (test #'eql))
  (member obj (cdr (member obj ls :test test))
          :test test))

(defun split-if (fn ls)
  (let ((acc nil))
    (do ((src ls (cdr src)))
        ((or (null src) (funcall fn (car src)))
         (values (nreverse acc) src))
      (push (car src) acc))))


(defun most (fn lst)(if (null lst)
(values nil nil)
(let* ((wins (car lst))(max (funcall fn wins)))
(dolist (obj (cdr lst))(let ((score (funcall fn obj)))
(when (&gt; score max)(setq wins obj
max score))))(values wins max))))
(defun best (fn lst)(if (null lst)nil(let ((wins (car lst)))(dolist (obj (cdr lst))
(if (funcall fn obj wins)
(setq wins obj)))wins)))
(defun mostn (fn lst)(if (null lst)
(values nil nil)
(let ((result (list (car lst)))(max (funcall fn (car lst))))(dolist (obj (cdr lst))
(let ((score (funcall fn obj)))(cond ((&gt; score max)
(setq max score
result (list obj)))((= score max)
(push obj result)))))(values (nreverse result) max))))

(defun map0-n (fn n)(mapa-b fn 0 n))
(defun map1-n (fn n)(mapa-b fn 1 n))
(defun mapa-b (fn a b &amp;optional (step 1))(do ((i a (+ i step))
(result nil))
((&gt; i b) (nreverse result))(push (funcall fn i) result)))
(defun map-&gt; (fn start test-fn succ-fn)(do ((i start (funcall succ-fn i))
(result nil))
((funcall test-fn i) (nreverse result))(push (funcall fn i) result)))
(defun mappend (fn &amp;rest lsts)
(apply #'append (apply #'mapcar fn lsts)))
(defun mapcars (fn &amp;rest lsts)(let ((result nil))(dolist (lst lsts)(dolist (obj lst)
(push (funcall fn obj) result)))(nreverse result)))
(defun rmapcar (fn &amp;rest args)
(if (some #'atom args)
(apply fn args)(apply #'mapcar
#'(lambda (&amp;rest args)
    (apply #'rmapcar fn args))args)))

(defun readlist (&amp;rest args)(values (read-from-string(concatenate 'string "("
(apply #'read-line args)")"))))
(defun prompt (&amp;rest args)
(apply #'format *query-io* args)(read *query-io*))
(defun break-loop (fn quit &amp;rest args)(format *query-io* "Entering break-loop.'~%")(loop
(let ((in (apply #'prompt args)))
(if (funcall quit in)
(return)
(format *query-io* "~A~%" (funcall fn in))))))

(defun mkstr (&amp;rest args)
(with-output-to-string (s)(dolist (a args) (princ a s))))
(defun symb (&amp;rest args)
(values (intern (apply #'mkstr args))))
(defun reread (&amp;rest args)
(values (read-from-string (apply #'mkstr args))))
(defun explode (sym)(map 'list #'(lambda (c)
(intern (make-string 1:initial-element c)))(symbol-name sym)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb472bb4" class="outline-3">
<h3 id="orgb472bb4"><span class="section-number-3">3.2.</span> Rethink Recursion</h3>
<div class="outline-text-3" id="text-3-2">
<p>
while other languages use <b>loop</b> for a complicated object, lisp prefer <b>recusion</b>. Consider a function that returns the length of a list:
</p>


<div class="org-src-container">
<pre class="src src-python"># similar to len(x)
def len(ls):
    i=0
    for x in ls:
        i+=1
    return i
</pre>
</div>

<p>
In lisp we may write it as:
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun len (ls)
  (if (null ls) 0 (1+ (len (cdr ls)))))
</pre>
</div>

<p>
Unfortunately the second example code is not as effective as <b>loop</b>, because the first python example is the "flattened" version of the second one, where we should store the function call of different usages of <code>len</code> in the stack.
</p>

<p>
However, we can change such <b>cdr recursion</b> into a <b>tail recursion</b> (as we know, a tail-recursion is equvilent to a loop), by introduce two variables:
</p>
<ol class="org-ol">
<li>a accumulator (named <code>acc</code>) similar to <code>i</code> in python code;</li>
<li>another style of recursor function <code>rec</code> which is the same to <code>len</code>.</li>
</ol>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun len (ls)
  (labels ((rec (ls acc)
                (if (null ls)
                    acc
                  (rec (cdr ls) (1+ acc)))))
    (rec ls 0)))
</pre>
</div>

<p>
noted that here the tail-recursion is also a cdr-recursion, and what we do is move the <i>operation</i> (here it is <code>1+</code>) to the accumulator.
</p>



<p>
That's all for the "function" part. In next notes I will detail
how to understand and use <b>macro</b> in <i>common lisp</i>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:liangzid@stu.xjtu.edu.cn">liangzid@stu.xjtu.edu.cn</a>)</span> <span class="date">Create Date: Fri Oct  6 16:20:35 2023</span> <span class="date">Last modified: 2026-05-12 Tue 20:20</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span> </div>
</div>
</body>
</html>
